mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xr/common/mb9bf46xr.h
/*******************************************************************************
* MFT Registers MFT1
*   Bitband Section
*******************************************************************************/
#define bFM_MFT1_ADCMP_ACSD0_AMOD                 *((volatile  uint8_t *)(0x42423AA0UL))
#define bFM4_MFT1_ADCMP_ACSD0_AMOD                *((volatile  uint8_t *)(0x42423AA0UL))
#define bFM_MFT1_ADCMP_ACSD0_OCUS                 *((volatile  uint8_t *)(0x42423AA4UL))
#define bFM4_MFT1_ADCMP_ACSD0_OCUS                *((volatile  uint8_t *)(0x42423AA4UL))
#define bFM_MFT1_ADCMP_ACSD0_DE                   *((volatile  uint8_t *)(0x42423AB0UL))
#define bFM4_MFT1_ADCMP_ACSD0_DE                  *((volatile  uint8_t *)(0x42423AB0UL))
#define bFM_MFT1_ADCMP_ACSD0_PE                   *((volatile  uint8_t *)(0x42423AB4UL))
#define bFM4_MFT1_ADCMP_ACSD0_PE                  *((volatile  uint8_t *)(0x42423AB4UL))
#define bFM_MFT1_ADCMP_ACSD0_UE                   *((volatile  uint8_t *)(0x42423AB8UL))
#define bFM4_MFT1_ADCMP_ACSD0_UE                  *((volatile  uint8_t *)(0x42423AB8UL))
#define bFM_MFT1_ADCMP_ACSD0_ZE                   *((volatile  uint8_t *)(0x42423ABCUL))
#define bFM4_MFT1_ADCMP_ACSD0_ZE                  *((volatile  uint8_t *)(0x42423ABCUL))

#define bFM_MFT1_ADCMP_ACSD1_AMOD                 *((volatile  uint8_t *)(0x42423B20UL))
#define bFM4_MFT1_ADCMP_ACSD1_AMOD                *((volatile  uint8_t *)(0x42423B20UL))
#define bFM_MFT1_ADCMP_ACSD1_OCUS                 *((volatile  uint8_t *)(0x42423B24UL))
#define bFM4_MFT1_ADCMP_ACSD1_OCUS                *((volatile  uint8_t *)(0x42423B24UL))
#define bFM_MFT1_ADCMP_ACSD1_DE                   *((volatile  uint8_t *)(0x42423B30UL))
#define bFM4_MFT1_ADCMP_ACSD1_DE                  *((volatile  uint8_t *)(0x42423B30UL))
#define bFM_MFT1_ADCMP_ACSD1_PE                   *((volatile  uint8_t *)(0x42423B34UL))
#define bFM4_MFT1_ADCMP_ACSD1_PE                  *((volatile  uint8_t *)(0x42423B34UL))
#define bFM_MFT1_ADCMP_ACSD1_UE                   *((volatile  uint8_t *)(0x42423B38UL))
#define bFM4_MFT1_ADCMP_ACSD1_UE                  *((volatile  uint8_t *)(0x42423B38UL))
#define bFM_MFT1_ADCMP_ACSD1_ZE                   *((volatile  uint8_t *)(0x42423B3CUL))
#define bFM4_MFT1_ADCMP_ACSD1_ZE                  *((volatile  uint8_t *)(0x42423B3CUL))

#define bFM_MFT1_ADCMP_ACSD2_AMOD                 *((volatile  uint8_t *)(0x42423BA0UL))
#define bFM4_MFT1_ADCMP_ACSD2_AMOD                *((volatile  uint8_t *)(0x42423BA0UL))
#define bFM_MFT1_ADCMP_ACSD2_OCUS                 *((volatile  uint8_t *)(0x42423BA4UL))
#define bFM4_MFT1_ADCMP_ACSD2_OCUS                *((volatile  uint8_t *)(0x42423BA4UL))
#define bFM_MFT1_ADCMP_ACSD2_DE                   *((volatile  uint8_t *)(0x42423BB0UL))
#define bFM4_MFT1_ADCMP_ACSD2_DE                  *((volatile  uint8_t *)(0x42423BB0UL))
#define bFM_MFT1_ADCMP_ACSD2_PE                   *((volatile  uint8_t *)(0x42423BB4UL))
#define bFM4_MFT1_ADCMP_ACSD2_PE                  *((volatile  uint8_t *)(0x42423BB4UL))
#define bFM_MFT1_ADCMP_ACSD2_UE                   *((volatile  uint8_t *)(0x42423BB8UL))
#define bFM4_MFT1_ADCMP_ACSD2_UE                  *((volatile  uint8_t *)(0x42423BB8UL))
#define bFM_MFT1_ADCMP_ACSD2_ZE                   *((volatile  uint8_t *)(0x42423BBCUL))
#define bFM4_MFT1_ADCMP_ACSD2_ZE                  *((volatile  uint8_t *)(0x42423BBCUL))

#define bFM_MFT1_ADCMP_ACSD3_AMOD                 *((volatile  uint8_t *)(0x42423C20UL))
#define bFM4_MFT1_ADCMP_ACSD3_AMOD                *((volatile  uint8_t *)(0x42423C20UL))
#define bFM_MFT1_ADCMP_ACSD3_OCUS                 *((volatile  uint8_t *)(0x42423C24UL))
#define bFM4_MFT1_ADCMP_ACSD3_OCUS                *((volatile  uint8_t *)(0x42423C24UL))
#define bFM_MFT1_ADCMP_ACSD3_DE                   *((volatile  uint8_t *)(0x42423C30UL))
#define bFM4_MFT1_ADCMP_ACSD3_DE                  *((volatile  uint8_t *)(0x42423C30UL))
#define bFM_MFT1_ADCMP_ACSD3_PE                   *((volatile  uint8_t *)(0x42423C34UL))
#define bFM4_MFT1_ADCMP_ACSD3_PE                  *((volatile  uint8_t *)(0x42423C34UL))
#define bFM_MFT1_ADCMP_ACSD3_UE                   *((volatile  uint8_t *)(0x42423C38UL))
#define bFM4_MFT1_ADCMP_ACSD3_UE                  *((volatile  uint8_t *)(0x42423C38UL))
#define bFM_MFT1_ADCMP_ACSD3_ZE                   *((volatile  uint8_t *)(0x42423C3CUL))
#define bFM4_MFT1_ADCMP_ACSD3_ZE                  *((volatile  uint8_t *)(0x42423C3CUL))

#define bFM_MFT1_ADCMP_ACSD4_AMOD                 *((volatile  uint8_t *)(0x42423CA0UL))
#define bFM4_MFT1_ADCMP_ACSD4_AMOD                *((volatile  uint8_t *)(0x42423CA0UL))
#define bFM_MFT1_ADCMP_ACSD4_OCUS                 *((volatile  uint8_t *)(0x42423CA4UL))
#define bFM4_MFT1_ADCMP_ACSD4_OCUS                *((volatile  uint8_t *)(0x42423CA4UL))
#define bFM_MFT1_ADCMP_ACSD4_DE                   *((volatile  uint8_t *)(0x42423CB0UL))
#define bFM4_MFT1_ADCMP_ACSD4_DE                  *((volatile  uint8_t *)(0x42423CB0UL))
#define bFM_MFT1_ADCMP_ACSD4_PE                   *((volatile  uint8_t *)(0x42423CB4UL))
#define bFM4_MFT1_ADCMP_ACSD4_PE                  *((volatile  uint8_t *)(0x42423CB4UL))
#define bFM_MFT1_ADCMP_ACSD4_UE                   *((volatile  uint8_t *)(0x42423CB8UL))
#define bFM4_MFT1_ADCMP_ACSD4_UE                  *((volatile  uint8_t *)(0x42423CB8UL))
#define bFM_MFT1_ADCMP_ACSD4_ZE                   *((volatile  uint8_t *)(0x42423CBCUL))
#define bFM4_MFT1_ADCMP_ACSD4_ZE                  *((volatile  uint8_t *)(0x42423CBCUL))

#define bFM_MFT1_ADCMP_ACSD5_AMOD                 *((volatile  uint8_t *)(0x42423D20UL))
#define bFM4_MFT1_ADCMP_ACSD5_AMOD                *((volatile  uint8_t *)(0x42423D20UL))
#define bFM_MFT1_ADCMP_ACSD5_OCUS                 *((volatile  uint8_t *)(0x42423D24UL))
#define bFM4_MFT1_ADCMP_ACSD5_OCUS                *((volatile  uint8_t *)(0x42423D24UL))
#define bFM_MFT1_ADCMP_ACSD5_DE                   *((volatile  uint8_t *)(0x42423D30UL))
#define bFM4_MFT1_ADCMP_ACSD5_DE                  *((volatile  uint8_t *)(0x42423D30UL))
#define bFM_MFT1_ADCMP_ACSD5_PE                   *((volatile  uint8_t *)(0x42423D34UL))
#define bFM4_MFT1_ADCMP_ACSD5_PE                  *((volatile  uint8_t *)(0x42423D34UL))
#define bFM_MFT1_ADCMP_ACSD5_UE                   *((volatile  uint8_t *)(0x42423D38UL))
#define bFM4_MFT1_ADCMP_ACSD5_UE                  *((volatile  uint8_t *)(0x42423D38UL))
#define bFM_MFT1_ADCMP_ACSD5_ZE                   *((volatile  uint8_t *)(0x42423D3CUL))
#define bFM4_MFT1_ADCMP_ACSD5_ZE                  *((volatile  uint8_t *)(0x42423D3CUL))

