mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xr/common/mb9bf46xr.h
#define bFM_SDIF_AHBCFGL_SINEN                    *((volatile  uint8_t *)(0x42DC200CUL))
#define bFM4_SDIF_AHBCFGL_SINEN                   *((volatile  uint8_t *)(0x42DC200CUL))
#define bFM_SDIF_AHBCFGL_BSLOCK                   *((volatile  uint8_t *)(0x42DC2010UL))
#define bFM4_SDIF_AHBCFGL_BSLOCK                  *((volatile  uint8_t *)(0x42DC2010UL))
#define bFM_SDIF_AHBCFGL_BSLOCKSEL                *((volatile  uint8_t *)(0x42DC2014UL))
#define bFM4_SDIF_AHBCFGL_BSLOCKSEL               *((volatile  uint8_t *)(0x42DC2014UL))
#define bFM_SDIF_AHBCFGL_ENDIANSEL                *((volatile  uint8_t *)(0x42DC2018UL))
#define bFM4_SDIF_AHBCFGL_ENDIANSEL               *((volatile  uint8_t *)(0x42DC2018UL))

#define bFM_SDIF_CAPBLTY0_TOCLKUNIT               *((volatile  uint8_t *)(0x42DC081CUL))
#define bFM4_SDIF_CAPBLTY0_TOCLKUNIT              *((volatile  uint8_t *)(0x42DC081CUL))

#define bFM_SDIF_CAPBLTY1_EMBD8BIT                *((volatile  uint8_t *)(0x42DC0848UL))
#define bFM4_SDIF_CAPBLTY1_EMBD8BIT               *((volatile  uint8_t *)(0x42DC0848UL))
#define bFM_SDIF_CAPBLTY1_ADMA2SPT                *((volatile  uint8_t *)(0x42DC084CUL))
#define bFM4_SDIF_CAPBLTY1_ADMA2SPT               *((volatile  uint8_t *)(0x42DC084CUL))
#define bFM_SDIF_CAPBLTY1_HGHSPDSPT               *((volatile  uint8_t *)(0x42DC0854UL))
#define bFM4_SDIF_CAPBLTY1_HGHSPDSPT              *((volatile  uint8_t *)(0x42DC0854UL))
#define bFM_SDIF_CAPBLTY1_SDMASPT                 *((volatile  uint8_t *)(0x42DC0858UL))
#define bFM4_SDIF_CAPBLTY1_SDMASPT                *((volatile  uint8_t *)(0x42DC0858UL))
#define bFM_SDIF_CAPBLTY1_LWPWRSPT                *((volatile  uint8_t *)(0x42DC085CUL))
#define bFM4_SDIF_CAPBLTY1_LWPWRSPT               *((volatile  uint8_t *)(0x42DC085CUL))
#define bFM_SDIF_CAPBLTY1_V33SPT                  *((volatile  uint8_t *)(0x42DC0860UL))
#define bFM4_SDIF_CAPBLTY1_V33SPT                 *((volatile  uint8_t *)(0x42DC0860UL))
#define bFM_SDIF_CAPBLTY1_V30SPT                  *((volatile  uint8_t *)(0x42DC0864UL))
#define bFM4_SDIF_CAPBLTY1_V30SPT                 *((volatile  uint8_t *)(0x42DC0864UL))
#define bFM_SDIF_CAPBLTY1_V18SPT                  *((volatile  uint8_t *)(0x42DC0868UL))
#define bFM4_SDIF_CAPBLTY1_V18SPT                 *((volatile  uint8_t *)(0x42DC0868UL))
#define bFM_SDIF_CAPBLTY1_BUS64SPT                *((volatile  uint8_t *)(0x42DC0870UL))
#define bFM4_SDIF_CAPBLTY1_BUS64SPT               *((volatile  uint8_t *)(0x42DC0870UL))
#define bFM_SDIF_CAPBLTY1_ASYINTSPT               *((volatile  uint8_t *)(0x42DC0874UL))
#define bFM4_SDIF_CAPBLTY1_ASYINTSPT              *((volatile  uint8_t *)(0x42DC0874UL))

#define bFM_SDIF_CAPBLTY2_SDR50SPT                *((volatile  uint8_t *)(0x42DC0880UL))
#define bFM4_SDIF_CAPBLTY2_SDR50SPT               *((volatile  uint8_t *)(0x42DC0880UL))
#define bFM_SDIF_CAPBLTY2_SDR104SPT               *((volatile  uint8_t *)(0x42DC0884UL))
#define bFM4_SDIF_CAPBLTY2_SDR104SPT              *((volatile  uint8_t *)(0x42DC0884UL))
#define bFM_SDIF_CAPBLTY2_DDR50SPT                *((volatile  uint8_t *)(0x42DC0888UL))
#define bFM4_SDIF_CAPBLTY2_DDR50SPT               *((volatile  uint8_t *)(0x42DC0888UL))
#define bFM_SDIF_CAPBLTY2_DRVTPASPT               *((volatile  uint8_t *)(0x42DC0890UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPASPT              *((volatile  uint8_t *)(0x42DC0890UL))
#define bFM_SDIF_CAPBLTY2_DRVTPCSPT               *((volatile  uint8_t *)(0x42DC0894UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPCSPT              *((volatile  uint8_t *)(0x42DC0894UL))
#define bFM_SDIF_CAPBLTY2_DRVTPDSPT               *((volatile  uint8_t *)(0x42DC0898UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPDSPT              *((volatile  uint8_t *)(0x42DC0898UL))
#define bFM_SDIF_CAPBLTY2_USETNSDR50              *((volatile  uint8_t *)(0x42DC08B4UL))
#define bFM4_SDIF_CAPBLTY2_USETNSDR50             *((volatile  uint8_t *)(0x42DC08B4UL))

#define bFM_SDIF_FEACEST_FEVNT12ND                *((volatile  uint8_t *)(0x42DC0A00UL))
#define bFM4_SDIF_FEACEST_FEVNT12ND               *((volatile  uint8_t *)(0x42DC0A00UL))
#define bFM_SDIF_FEACEST_FEVNTTO                  *((volatile  uint8_t *)(0x42DC0A04UL))
#define bFM4_SDIF_FEACEST_FEVNTTO                 *((volatile  uint8_t *)(0x42DC0A04UL))
#define bFM_SDIF_FEACEST_FEVNTCRC                 *((volatile  uint8_t *)(0x42DC0A08UL))
#define bFM4_SDIF_FEACEST_FEVNTCRC                *((volatile  uint8_t *)(0x42DC0A08UL))
#define bFM_SDIF_FEACEST_FEVNTEB                  *((volatile  uint8_t *)(0x42DC0A0CUL))
#define bFM4_SDIF_FEACEST_FEVNTEB                 *((volatile  uint8_t *)(0x42DC0A0CUL))
#define bFM_SDIF_FEACEST_FEVNTIDX                 *((volatile  uint8_t *)(0x42DC0A10UL))
#define bFM4_SDIF_FEACEST_FEVNTIDX                *((volatile  uint8_t *)(0x42DC0A10UL))
#define bFM_SDIF_FEACEST_FEVNTCMD12               *((volatile  uint8_t *)(0x42DC0A1CUL))
#define bFM4_SDIF_FEACEST_FEVNTCMD12              *((volatile  uint8_t *)(0x42DC0A1CUL))

#define bFM_SDIF_MCWIRQC0_WTIRQEN                 *((volatile  uint8_t *)(0x42DC2500UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQEN                *((volatile  uint8_t *)(0x42DC2500UL))
#define bFM_SDIF_MCWIRQC0_WTIRQST                 *((volatile  uint8_t *)(0x42DC2504UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQST                *((volatile  uint8_t *)(0x42DC2504UL))

#define bFM_SDIF_MMCSDCH_BTACKENMMC               *((volatile  uint8_t *)(0x42DC24C0UL))
#define bFM4_SDIF_MMCSDCH_BTACKENMMC              *((volatile  uint8_t *)(0x42DC24C0UL))
#define bFM_SDIF_MMCSDCH_BTABTENMMC               *((volatile  uint8_t *)(0x42DC24C4UL))
#define bFM4_SDIF_MMCSDCH_BTABTENMMC              *((volatile  uint8_t *)(0x42DC24C4UL))
#define bFM_SDIF_MMCSDCH_BTMDENMMC                *((volatile  uint8_t *)(0x42DC24C8UL))
#define bFM4_SDIF_MMCSDCH_BTMDENMMC               *((volatile  uint8_t *)(0x42DC24C8UL))

#define bFM_SDIF_MMCSDCL_LCKRSTESD                *((volatile  uint8_t *)(0x42DC2480UL))
#define bFM4_SDIF_MMCSDCL_LCKRSTESD               *((volatile  uint8_t *)(0x42DC2480UL))
#define bFM_SDIF_MMCSDCL_RSTMMC                   *((volatile  uint8_t *)(0x42DC2484UL))
#define bFM4_SDIF_MMCSDCL_RSTMMC                  *((volatile  uint8_t *)(0x42DC2484UL))
#define bFM_SDIF_MMCSDCL_VCCCTLMMC                *((volatile  uint8_t *)(0x42DC2488UL))
#define bFM4_SDIF_MMCSDCL_VCCCTLMMC               *((volatile  uint8_t *)(0x42DC2488UL))
#define bFM_SDIF_MMCSDCL_VCCQCTLMMC               *((volatile  uint8_t *)(0x42DC248CUL))
#define bFM4_SDIF_MMCSDCL_VCCQCTLMMC              *((volatile  uint8_t *)(0x42DC248CUL))
#define bFM_SDIF_MMCSDCL_MMCDDRSEL                *((volatile  uint8_t *)(0x42DC24A0UL))
#define bFM4_SDIF_MMCSDCL_MMCDDRSEL               *((volatile  uint8_t *)(0x42DC24A0UL))
#define bFM_SDIF_MMCSDCL_CMDDATDLY                *((volatile  uint8_t *)(0x42DC24A4UL))
#define bFM4_SDIF_MMCSDCL_CMDDATDLY               *((volatile  uint8_t *)(0x42DC24A4UL))

#define bFM_SDIF_PSWISGEL_INT5MSSGEN              *((volatile  uint8_t *)(0x42DC2400UL))
#define bFM4_SDIF_PSWISGEL_INT5MSSGEN             *((volatile  uint8_t *)(0x42DC2400UL))
#define bFM_SDIF_PSWISGEL_INT1MSSGEN              *((volatile  uint8_t *)(0x42DC2404UL))
#define bFM4_SDIF_PSWISGEL_INT1MSSGEN             *((volatile  uint8_t *)(0x42DC2404UL))

#define bFM_SDIF_PSWISTEL_INT5MSSTS               *((volatile  uint8_t *)(0x42DC2380UL))
#define bFM4_SDIF_PSWISTEL_INT5MSSTS              *((volatile  uint8_t *)(0x42DC2380UL))
#define bFM_SDIF_PSWISTEL_INT1MSSTS               *((volatile  uint8_t *)(0x42DC2384UL))
#define bFM4_SDIF_PSWISTEL_INT1MSSTS              *((volatile  uint8_t *)(0x42DC2384UL))

